tutorials/bayesianOptimization/Bayesian Optimization of chip cooling/chip_cooling/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
    	value		$internalField;    
    }

    top 
    {
        type            zeroGradient;
    }

    bottom
    {
        type            zeroGradient;
    }

    side1
    {
        type            zeroGradient;
    }
    
    side2
    {
        type            zeroGradient;    
    }
    solid
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
