tutorials/bayesianOptimization/Bayesian Optimization of chip cooling/chip_cooling/system/Allclean
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/CleanFunctions  # Tutorial clean functions

cleanCase
rmdir constant 2>/dev/null

#------------------------------------------------------------------------------
