tutorials/bayesianOptimization/Bayesian Optimization of chip cooling/chip_cooling/Allrun.pre
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
# Link to source the FreeCAD Python library
cat obstacles.stl channel.stl > chip_cooling_mm.stl;
surfaceTransformPoints -scale 0.001 chip_cooling_mm.stl chip_cooling_m.stl
surfaceFeatureEdges chip_cooling_m.stl chip_cooling_m.fms;
cartesianMesh;
checkMesh -constant;
topoSet;
decomposePar;
touch foam.foam
#------------------------------------------------------------------------------
